Tekla Open API Reference for Tekla Structures 2025
ModificationInfo.Deleted Field
List of objects which have been deleted
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObjectEnumerator Deleted
Public Deleted As ModelObjectEnumerator
Field Value
Type: ModelObjectEnumerator
See Also
Reference
ModificationInfo Structure
Tekla.Structures.Model.History Namespace